Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: As part of the conference, an ATP systems (provers) competition is carried on.
ru: В рамках конференции проводится конкурс программных систем АДТ (пруверов).

source: As soon as you close the shell, this will no longer be a variable.
ru: Как только вы закроете оболочку, переменная более не будет доступна.

source: As stated in papers of our colleagues, the uncertainties is the main point of reduction of the model ability to make precise forecast and reveal real properties of the consumer products manufacturing and service provision.
ru: Как говорится в статьях наших коллег неопределенности являются основной точкой снижения возможности модели делать точные прогнозы и выявления реальных свойств производства товаров широкого потребления и оказания услуг.

source: As we talked about, these numbers are the exit codes of the test commands and are stored in the built-in variable $?.
ru: Эти числа являются значениями завершения команды test и хранятся во встроенной переменной $?.

source: As you can see in the last couple lines, there are many ways to match the same text.
ru: Как вы можете видеть в последних двух строках, есть много способов сопоставить один и тот же текст.

source: As you can see, all three languages utilize regular expressions a bit differently, but the actual expression that we are writing in each is exactly the same.
ru: Обращаем внимание, что эти три языка используют регулярные выражения немного по-разному, но само абсолютно одинаково во всех случаях.

source: As you can see, depending on the complexity of the text you are searching, you may have to go through some trial/error before you get the right regular expression for the job.
ru: Как видите, в зависимости от сложности текста, возможно, придется попробовать вариантов выражений, прежде чем получится правильное регулярное выражение.

source: As you can see, regular expressions can be used in a multitude of ways.
ru: Как видите, регулярные выражения можно использовать по-разному.

source: As you can see, the possibilities here are endless and if used to its potential, the find command can solve a lot of issues that you never knew it could.
ru: Как видно, возможности find практически безграничны, и если использовать ее весь потенциал, можно решить много разных задач, включа те, до которых вы раньше не додумывались.

source: As you can see, the request starts at my computer’s gateway, jumps over to a Spectrum server in Kansas, connects to a server in Chicago, connects to Digital Ocean’s servers in New York, and finally gets to my website server in New Jersey.
ru: Как видите, путь начинается со шлюза компьютера, переходит на сервер Spectrum в Канзасе, подключается к серверу в Чикаго, подключается к серверам Digital Ocean в Нью-Йорке и, наконец, попадает на сервер веб-сайта в Нью-Джерси.

source: As you can see, they all follow a similar data structure, but are not considered “structured” data of any kind.
ru: Как видите, все они по структуре похожи друг на друга, однако, их не считают строгоструктурированными.

source: As you can see, we can use the built-in variables inside our scripts.
ru: Итак, использование встроенных переменных внутри скриптов возможно.

source: As you might have noticed there are some built in variables to awk which include FS (file separator), OFS (output separator), NR (number of rows), and many more that can be found here.
ru: Как можно было заметить, в awk есть встроенные переменные, включая FS (символ-разделитель входного файла), OFS (символ-резделитель для выходного файла), NR (номер строки). Дркгие переменные можно найти здесь.

source: As you might have noticed, you can write any quantifier using the {} brackets alone, but sometimes, the *, +, and ? are quicker and cleaner to write.
ru: Заметим, что любой квантор может быть определен при помощи {}, но на практике использование *, + и ? позволяет создавать регулярные выражения быстрее

source: Aside from basic commands such as cd, ls, mkdir, touch, etc., there is a short list of commands that I think every bash user should know about and attempt to use on a regular basis.
ru: Помимо основных команд, таких как cd, ls, mkdir, touch и т.д., есть небольшой список команд, которые в bash используются на регулярной основе.

source: Assuming it does not find it right away in its cache, it will start at the root domain database for the .com top-level-domain, which is hosted by the company VeriSign.
ru: Предполагая, что он не найдет его сразу в своем кеше, он начнет искать с базы данных корневого домена для .com, домена верхнего уровня, размещенного на хостинге компании VeriSign.

source: At first glance it does not sound all that interesting, but since UNIX based operating systems store everything as a file, this tool can allow us to see more than just open text files.
ru: На первый взгляд это не так уж интересно, но, поскольку в операционных системах на базе UNIX все объекты представляются в виде файлов, этот инструмент позволяет видеть больше, чем просто открытые процессом файлы.

source: At first, let us consider research devoted to the productivity of the algorithms and improving the analysis results quality.
ru: Сначала рассмотрим исследования, посвященные производительности алгоритмов и повышению качества результатов анализа.

source: At present, we have not found a standardized way of the integration: there are only prototypes of annotation resources, like BioSearch [26] implemented on the base of BIO2RDF LOD technologies.
ru: В настоящее время мы не нашли стандартизованного способа интеграции: есть только прототипы аннотационных ресурсов, такие как BioSearch [26], реализованные на основе технологий BIO2RDF LOD.

source: At the A. P. Ershov Institute of Informatics Systems (IIS SB RAS) at the Laboratory of Theoretical Programming developed and implemented an experimental system for program verification named “SPEKTR” that includes subsystem of compilers verification, program implementations of the linear algebra, sorting arrays and files.
ru: В Институте систем информатики им А.П. Ершова (ИСИ СО РАН) в лаборатории теоретического программирования разработана и внедрена экспериментальная система для верификации программ под названием “Спектр”, которая включает в себя подсистему пролверки компиляторов, программ реализации процедур в линейной алгебре, сортировки массивов и файлов.

source: At the Department of Computer Science of the Faculty of Mathematics and Mechanics, St. Petersburg State University, Alexander Sergeyevich Gerasimov in 2007 he defended the thesis "Development and implementation of the search algorithm in expansion of Lukasiewicz infinite-predicate logic", it is an application of ATP in nonclassical logics.
ru: На кафедре информатики факультета математики и механики Санкт-Петербургского государственного университета, А.С.Герасимов в 2007 году защитил кандидатскую диссертацию на тему "Разработка и реализация алгоритма поиска в расширении бесконечно-предикативной логики Лукасевича", это применение автоматического доказательства теорем (АДТ) в неклассических логиках.

source: At this point, given only one piece of information, my browser application must embark on a journey across the world wide web to find this website.
ru: Теперь, используя эту информацию, браузерное приложение "должно отправиться в путешествие по всемирной паутине", чтобы найти веб-сайт.

source: At this point, my router has started with the default OpenDNS server to look for thediygolfer.com, but failing to find it, OpenDNS redirected the router to the root domain database, which then found the domain and redirected the router to Digital Ocean nameservers, which know exactly where the physical machine that my site is running on is.
ru: На этом этапе мой маршрутизатор запустил сервер OpenDNS по умолчанию для поиска thediygolfer.com, но не сумев найти его, OpenDNS перенаправил маршрутизатор в базу данных корневого домена, который, затем, нашел домен и перешел на серверы имен Digital Ocean, точно знающие, где находится физический сервер сайта.

source: At this point, we have concluded in the most anti-climactic way possible that regular expressions can carry out the basic function of literal text matching.
ru: На этом этапе запоминаем, что регулярные выражения согут выполнять функцию буквального сопоставления текста.

source: At this point, you’ve probably already looked up what that period . character does in a regex.
ru: Символ . соответствует любому символу входной строки.

source: At this stage we limited our implementation with Mothur software specifics, but in the same time do not bother with data conversion.
ru: На данном этапе наша реализация ограничена спецификой программного обеспечения Mothur, но при этом не занимались с преобразованием данных.

source: Authors doubt about the possibility to organize a laboratory HPC-center based on cluster computing by NGS software users and suggest to deal with IaaS cloud computing.
ru: Авторы сомневаются в возможности организации лабораторного HPC-центра на базе кластерных вычислений пользователями программного обеспечения NGS и предлагают заняться облачными вычислениями IaaS.

source: Authors pay attention to open-source cloud (Open Stack) and construction tools, like Common Workflow Language (CWL) [16] used to represent the computational process in a cloud.
ru: Авторы обращают внимание на облачную технологию с открытым исходным кодом (Open Stack) и его инструментарий - Common Workflow Language (CWL) [16], используемый для представления вычислительного процесса в облаке.

source: Authors propose own visual tool VisPro, connected to a cloud.
ru: Авторы предлагают собственный визуальный инструмент VisPro, подключенный к облаку.

source: Automatic theorem proving is used in one of the modules - theorem generator module, which builds a mathematical theorem based on the program and the description of the requirements which must be satisfied.
ru: Автоматическое доказательство теорем используется в модуле-генераторе теорем, который строит логические теоремы, соответствующие верифицируемой программе и описаниям требований, которые должны быть удовлетворены.

source: Automatica, 2018, 93: 407-414.) proposed the distributed coordinated predictive control method under the resource limitation, and adopted the time-division and multiple-access technology to coordinate the sub-system.
ru: Automatica, 2018, 93: 407-414.) предложил метод распределенного скоординированного прогнозирующего управления при ограничении ресурсов, и адаптировал технологии разделения времени и множественного доступа для координации подсистемы.

source: Automatica, 2019, 99: 92-98.) proposed an event-driven distributed predictive control method, which implemented asynchronous coordination for each agent (subsystem) and reduced the computation and communication burden.
ru: Automatica, 2019, 99: 92-98.) предложил событийный метод распределенного предиктивного управления, в котором реализована асинхронная координация для каждого агента (подсистемы), удалось сократить вычисления и накладные расходы на коммуникацию.

source: Awk can do much more than what has been shown including editing files.
ru: Программа awk обладает большим набором функций, включая редактирование файлов.

source: Awk considered a computationally complete programming language and is catered more towards large data that is delimiter separated.
ru: Язык awk считается вычислительно полным языком программирования (полным по Тьюрингу?) и больше ориентирован на табличные текстовые данные, где столбцы разделены специальными символами, например формата CSV (Comma Separated Values).

source: Awk is a bit of a tough command to learn because it is more of a programming language than a command line tool.
ru: Программа awk - это больше язык программирования, а не команда обработки текста.

source: Based on the data, we know our computer is online and able to connect to thediygolfer.com.
ru: Основываясь на этих данных, получается, что наш компьютер подключен к сети и может подключиться к thediygolfer.com.

source: Based on the previous paper and paper (Li S, Zhang Y, Zhu Q. Nash-optimization enhanced distributed model predictive control applied to the Shell benchmark problem.
ru: Основываясь на результатах предыдущей статьи и статьи (Li S, Zhang Y, Zhu Q. Nash-optimization enhanced distributed model predictive control applied to the Shell benchmark problem.

source: Bash Essentials
ru: Основы командной оболочки Bash

source: Bash Scripting
ru: Сценарии Bash

source: Bash scripting solves this problem by allowing you to write common bash commands within a script file and then execute that script file.
ru: Разработка сценариев Bash решают эту проблему, позволяя писать обычные команды bash в файле сценария, а затем исполнять его.

source: Before we go into how we can organize our fields, we need to walk through the default fields and what they mean.
ru: Прежде чем научиться указывать поля, надо перечислить имена полей по умолчанию, показать что они означают.

source: Believe it or not, when you run a program like Google Chrome, the kernel will give it resources for a few seconds and then do a “context switch” where it hands those same resources off to another process for a few seconds.
ru: Верьте или нет, при запуске программы, например, Google Chrome, ядро даст ему ресурсы в течение нескольких микросекунд, а затем произойдет "переключение контекстов", и эти же ресурсы будут на время отданы другому процессу.

source: Below are a few examples that demonstrate the use of quantifiers.
ru: Приведм еще несколько примеров, которые демонстрируют использование кванторов.

source: Below is a simple use of test on the command line (outside of a script).
ru: Ниже показано простое использование test в командной строке (вне сценария).

source: Beyond the basics and user permissions, one must learn about environment variables, aliases, and some more advanced commands relating to topics of networking, process management, ssh, and scripting.
ru: Перед освоением основ и управления правами пользователя необходимо изучить переменные среды, псевдонимы и некоторые более сложные команды, относящиеся к сетям, управлению процессами, ssh и сценариям.

source: Beyond the basics and user permissions, one must learn about environment
ru: Помимо основ и управления доступом пользователей, необходимо изучить среду.

source: Both of these can be set at the command line when starting the program.
ru: Оба фильтра можно установить на командной строке при запуске программы.

source: Both of these tools are considered text editors because they can find and replace parts of a file or files.
ru: Обе программы обрабатывают тексты, они могут находить и заменять части одного файла или наборы файлов.

source: Built-In Variables
ru: Встроенные переменные

source: Built-in variables
ru: Встроенные переменные

source: But in Russia, attention to DESs is undeservedly little.
ru: В России внимание к ДСС незаслуженно мало.

source: But the problem state is based on the supposition that there exists infinite rational opposing agents to the main player.
ru: Но задача моделирования ставится в предположении, что существует бесконечное число рационально действующих агентов, противопоставляющихся главному игроку.

source: But there are multiple processes that are running at any given time, so where are they running?
ru: Есть процессы, которые выполняются всегда, и где они работают?

source: But this is exactly where regular expressions start to get interesting, because not only can they match literal strings of characters, but also patterns of characters in specified quantities.
ru: Но именно в этой точке становится интересным изучение регулярных выражений, потому что они могут не только устанавливать буквальное соответствие, но и сравнивать тексты с шаблонам символов.

source: But what if I modified the text file one more time like so?
ru: Но что, если изменить текстовый файл еще раз следующим образим?

source: But what if VSCode is not availabe to you?
ru: Но что делать, если VSCode недоступен?

source: But what if we wanted all the DNS records for a domain?
ru: Но что, если нужны все записи DNS для домена?

source: By default, any key that is not id_rsa will not be added to the ssh-agent utility, and not the Mac keychain.
ru: По умолчанию любой ключ, который не является файлом id_rsa не будет добавлен ни в программу ssh-agent, ни в "связку ключей" Mac.

source: By default, top gives quite a bit of output, and oftentimes, we will need to scroll through it.
ru: По умолчанию, top выдает много данных, и иногда надо будет прокрутить список.

source: By means of classical logical approaches, implemented in contemporary Prolog interpreters, input visual model transformations will be realized.
ru: С помощью классических логических подходов, реализованных в современных системах программирования Prolog, будут реализованы специализированные алгоритмы трансформации входных визуальных моделей.

source: By now, you should have an intermediate to advanced skill-set using the bash shell, and paired with users, groups, and permissions, you will have a high level understanding of Bash (and even Linux for that matter).
ru: К данному моменту у вас должен сформироваться набор навыков среднего - продвинутого уровня использования оболочки bash, вы должны быть в курсе того, что такое users, groups, и permissions. Надеюсь, что у вас рано илии позно будет высокий уровень понимания bash и даже Linux.

source: By removing these columns, the calculation of a large number of distances is accelerated.
ru: При удалении этих столбцов (частей прочтений), процесс расчета большого количества расстояний ускоряется.

source: By the end of this section, you will fully understand (at a high level) what happens when you type “www.thediygolfer.com" in your browser.
ru: К концу раздела вы получите понимание на высоком уровне, что происходит, когда вы набираете “www.thediygolfer.com" в браузере .

source: By this dimensionality of practically interest representations of RBC are so large, and time, necessary for their construction, so long, that in most cases it is very hard or even impossible to apply known GT approaches to the adequate modelling of real RBC.
ru: Размерность формализаций РК, представляющих практический интерес, настолько большая, а время, требуемое для их построения, настолько огромно, что в большинстве случаев очень сложно или даже невозможно применить известные подходы ТИ для адекватного моделирования реальных РК.

source: By using the ^ character in our regular expression, we can isolate just the first three characters.
ru: Используя символ ^ в регулярном выражении, выделяем только первые три символа.

source: CIM and PIM ontologies are used to represent relations between stored objects as subjects of input and output of Mothur commands.
ru: Онтологии CIM и PIM используются для представления отношений между хранимыми объектами как субъектами входных и выходных данных команд Mothur.

source: COMMAND - The command that started the program.
ru: COMMAND - Команда, стартовавшая процесс.

source: CP allows one to construct reusable pieces of software, which can be used independently of the original development and execution context, resulting in the better maintainability of the source code.
ru: КП позволяет создавать повторно-используемые части программного обеспечения, которые можно применять независимо от исходного контекста разработки (проекта), при этом исходны код становится более приспособленным к сопровождению.

source: CPU
ru: Вычислительные (CPU)

source: CPU time statistics including us (user time un-niced), sy (system time), ni (user time niced), id (idle time), and wa (I/O wait time).
ru: Статистика времени использования процессора, включая us (время пользователя, un-niced), sy (время системы), ni (время пользователя, niced), id (время холостого хода), и wa (время ожидания В-В).

source: Carrying on regular seminars (at least one per two months).
ru: Поддержка регулярныъ семинаров (не менее одного в два месяца).

source: Chances are, you will not need to use regular expressions on a daily basis, so I am not going to teach you all the nitty gritty details that you will forget within a day.
ru: Скорее всего, не потребуется использовать регулярные выражения ежедневно, мы не будем давать все мельчайшие детали, забываемые к концу дня.

source: Check your filters by typing CTRL-o (control + the letter o)
ru: Проверка фильтров осуществляется CTRL-o (control + клавиша o)

source: Chimeric sequences are contigs constructed from rRNA partial readings (right-to-left, left-to-right) of different species, but having common parts.
ru: Химерные последовательности представляют собой контиги, построенные из частичных считываний рРНК (справа налево, слева направо) разных видов, но имеющих общие части.

source: Chinese colleagues already have certain foundation on the control synthesis, modeling and optimization of production scheduling and planning, description and management method for uncertainties occurring in production process.
ru: У наших китайских коллег есть база накопленных результатов исследований в областях синтеза управления, моделирования и оптимизации планирования процесса производства, описания и управления неопределенностями, возникающими в процессе производства.

source: Clear your filters by typing =
ru: Очистить фильтры можно нажав =

source: Cloud nodes perform only alignment.
ru: Облачные узлы выполняют только выравнивание.

source: Coaxial cables (what you have in your house)
ru: Коаксиальные кабели, что сейчас уже не встречается

source: Collect statistical data for the chosen criteria.
ru: Сбор статистических данных для выбранных критериев.

source: Command Line Arguments
ru: Аргументы командной строки

source: Command line arguments
ru: Параметры запуска программы

source: Command shhh.flows uses a expectation-maximization algorithm to correct flowgrams to identify the idealized form of each flowgram and translate that flowgram to a DNA sequence.
ru: Команда ```shhh.flows``` использует EM-алгоритм (англ. Expectation-maximization (EM) algorithm) корректировки ```flowgrams``` для определения идеализированной формы каждой ```flowgram```-мы и перевода этой ```flowgram```-мы в последовательность ДНК.

source: Common Commands
ru: Основные команды

source: Compare simulation results and the software performance with the previous versions of software.
ru: Сравнение результатов моделирования и скорости исполнения программного обеспечения с предыдущими (непараллельными) версиями программного обеспечения.

source: Compared with non-cooperative distributed predictive control, the former takes the global performance index of the system as a function of each subsystem's performance index, which can ensure the optimal global performance index and improve the convergence speed while considering the subsystem's performance.
ru: --- По сравнению с некооперативным распределенным предиктивным управлением, первый вычисляет глобальный индекс эффективности системы как функцию индексов эффективности каждой подсистемы, что, как правило, обеспечивает оптимальное значение глобального индекса производительности, а также повышение скорости сходимости при рассмотрении производительности подсистемы.

source: Comparison the results of the computer simulation with the existing results on the base of the generalized criteria.
ru: Сравнение результатов моделирования с результатами методов, основанных на оценке обобщенных критериев (ранее разработанных методов).

source: Competing and rival approaches and collectives
ru: Коллективы-конкуренты
